[{"name":"AFFORD MEDICAL TECHNOLOGIES PVT. LTD.","tq1":"[Live coding] Develop a HTTP microservice called prefix-management-service that exposes a GET REST API \"/prefixes\". This API receives a query parameter. This query param is called \"keywords\".  http://localhost:port/prefixes?keywords=bonfire,bool  Now, consider we have list of words already present in the server  [bonfire, cardio, case, character, bonsai]  Your task is to:  1. find if the keywords are found in the server or not 2. if any keyword is found, you need to return the smallest unique prefix that identifies the keyword Response of above API call would be like this  [     {         \"keyword\": \"bonfire\",         \"status\": \"found\",         \"prefix\": \"bonf\"     },     {         \"keyword\": \"bool\",         \"status\": \"not_found\",         \"prefix\": \"not_applicable\"     } ] Please note you can hardcode 20 words in the server for testing.  Test Case 1:  http://localhost:port/prefixes?keywords=bonfire,bonsai  Expected Output:  [     {         \"keyword\": \"bonfire\",         \"status\": \"found\",         \"prefix\": \"bonf\"     },     {         \"keyword\": \"bonsai\",         \"status\": \"found\",         \"prefix\": \"bons\"     } ]","tq2":"[live coding] Create a login and register api endpoints with jwt authentication in 1.5 hours, what is trie data structure [https://www.geeksforgeeks.org/longest-common-prefix-using-trie/?ref=rp] , how will you handle 1M requests on a single server, and which metohd will you use to optimise the time per request.","hq1":"Tell me about yourself, how did you organize your timings and task while working on internship, given a situation where you think the right aproch is different from others , will you persist on it or be flexible,","mrq":"","logo":"https://media.licdn.com/dms/image/C510BAQGX5oqJar8SNQ/company-logo_200_200/0/1541261723793?e=2147483647&v=beta&t=X-sPGcJX-zCMzTxGh4r8ZogBMb47EX3j-0nT9j78Hq4"},{"name":"Air Aisa","tq1":"Coding: 1) find three integers in nums such that the sum is closest to target. 2) Binary Search","tq2":"Database: Retrieve the 2 nd highest salary from employee table. 2) Find the duplicate in table","hq1":"Where do you see yourself in next 5 years?","mrq":"","logo":"https://upload.wikimedia.org/wikipedia/commons/thumb/f/f5/AirAsia_New_Logo.svg/768px-AirAsia_New_Logo.svg.png"},{"name":"Amadeus Labs","tq1":"Print the frequency of each letter along with the letter in a string in the format : a1b2c6d4, Print all the prime numbers in a given range, Implement Compile Time Polymorphism, detect a cycle in linked list\nAbout the project, Challenges faced in projects, Data Structure theory questions\nReverse a string and find if it is a palindrome or not\nis Java a complete Object oritented programming language? explain. Implement a standard template library (STL) data structure like stack using generics. Difference between runtime polymorphism and compile time polymorphism. Data hiding and data abstraction in java\n1. Kth largest in an array - live coding, 2. Design system of a URL shortner, 3. DSA, OS, DBMS general questions 4. Questions on projects\nFind angle between hands of a clock-programming\nYour preferred programming language and why do you prefer? What is OOPS? What is inheritance and mention it's types with examples. What is polymorphism and how is polymorphism classified? Difference between function overloading and overriding","tq2":"Which data structure would you use for storing data of a bookstore, how will you fetch data of books with same tags, explain the method and reason, Write a program to demonstrate the 4 pillars of OOP, Implement Quick Sort\n2 coding questions (1st Question- Data structure Graph, 2nd Question- Data Structure Greedy Algorithm)\nDemonstrate an example of class/objects using multiple or multilevel inheritance with different data types like integer, string, vector\n\n\nFind loop in the linked list- programming\nA simple python program based upon situation - a list containing negative, positive and 0. Rearrange it in such a way that negative numbers are towards left, 0 in the middle and positive are towards right. What are trees and mention the types of traversals. What is the difference between binary tree and normal tree? What is a queue and what are the ways that you can implement a queue? Tree based puzzle question - 3 jugs problem","hq1":"Suppose you are in a team with only a single partner and 2 of you working on a tight deadline, your partner unexpectedly leaves the company, what will you do? You have 2 options: a) ask team lead to postpone the deadline and to provide more resources ; b) learn a bit about your partners work and ask for your team lead's help, Tell about yourself. Tell about hobbies in depth. Your learnings outside of academics, Explain your projects, who is one person you're truly inspired from and why\nAbout the company, Why do you want to become a SDE?, Situational based questions\nWhat's your family background? Do you know anyone in Bangalore? Do you have any plans for higher education?\nDo you have any idea what the company actually does? Anytime in past have you ever lead or been a part of group project? if there's a conflict in your team and you're leading the group how will you approach.\n1. Intro 2. Why join Amadeus 3. Why should we hire you\nWhat do you know about amadeus\nWhat are your strengths? What is your favorite hobby and why? What do you consider as your biggest achievement? What is your favorite color and why?","mrq":"\n\n\n\n\n\n","logo":"https://static.businessworld.in/article/article_extra_large_image/1668747735_MmIh3Z_amadue.jpg"},{"name":"Amazon","tq1":"Test cases for 3 scenarios\n1. About projects. 2. Print all possible valid parentheses of length N. 3. Print the length and substring of the longest possible substring with distinct characters. 4. Print all possible unique pairs with the given sum from an array.\nDescribe functionality and write test cases for errors in amazon shopping cart , test data generation related question, what would be the debug process if blank screen error occurs\nPrint the left diagonal of a tree, Longest substring without repeating characters\nProject demo,Granularity of filters available in Power BI\nwrite a code to find the second largest number of list\n(i) Explanation on all types of joins (ii) Given a table, what will be the result of various joins (iii) Difference between WHERE and HAVING clause (iv) Can HAVING be used without GROUP BY ? (v) Given a String, print the output with the char along with the count of its successive occurence.","tq2":"Code for validation of a mathematical expression , questions on testing\n\n\n\nTypes of join and number of conditions, Business Intelligence theory- data cube, rollbacks, oltp olap\nprovided the test case scenario of credit card and asked to write the test cases about it .\n(i) Questions related to joins on multiple tables. (ii) Explanation of Big Data Technologies. (iii) Difference between Hadoop and Spark (iv) Data Warehousing concepts","hq1":"-\n1. More about my projects. 2. what are the phases involved in SDLC 3. Elaborate SDLC with given scenario (A client required a website for his business). 3. Difference between manual testing and automation testing. 4. About API testing. 5. what is Integration testing ? and when it is required to perform? 6. write the test cases for login page and registration page. 7. what is Automation Testing Framework? 8. What is test strategy? 9. Difference between the Black box testing and White Box testing? 10. when is automation testing required?.\nNo hr\nProject discussion, introduction, hobbies\nChallenges faced and how I overcame that\nThey have given the scenario of whats app and asked the test cases\nHR round was not conducted seperately.","mrq":"\n\n\n\n\n\n","logo":"https://img.etimg.com/thumb/msid-59738992,width-640,resizemode-4,imgsize-25499/amazon.jpg"},{"name":"Amdocs","tq1":"Write the code for fibonacci numbers if n=5.\nWhat is normalisation? Explain 2NF & 3NF.\nDifference between abstract classes and interfaces\n1.Write recurrsion binary search code. 10.What is multithreading? are different types of database. 3.What are SQL commands, 4.What is difference between ddl and dml. 5.What are indexers used for. 6.What is ACID property. 7.What is the time complexity of Merge Sort,Quick Sort, binary Search,etc.. 8. What is Runtime Polymorphism and write code of it. 9.What are virtual Functions. 10.\nDifference between Stack and Queue? Difference between list and array? What is implementation and polymorphism in java? Difference between public private protected? A question related to keys in dbms.\nWrite a code to validate whether a linked list is circular or not.\nReverse string\nFind duplicate element in the array, stock buy and sell problem, next greater element in binary search tree, missing element in the array\nStar Pattern coding question, Operating system questions based on deadlocks, preemptive etc, resume based,\nWhat is the difference between primary key and foreign key?\nTell about the projects you've have mentioned in the resume, concepts of OOPs and ML\nOOPS concepts\nIntroduction,Explanation of projects,project usage related to real life, Live coding of palindrome,oops concepts and real life examples, strengths,weakness and how you overcame ,bubble sort,sql query,sorting algorithm, web development related questions etc\nIdentify the pattern for the series and write program for it, reverse a Linked list, circular loop in Linked list, Puzzles\nQueries in SQL\nWrite a program to perform replace characters in a string without using in built replace function\nFibonacci series\nSwap 2 numbers without the help of an extra variable\nCode for swapping of numbers without using third variable, Reverse the Whole sentence of string, Difference between multiple level inheritance and multi level inheritance, oops concepts with real life examples and syntax\nCode for reversing string in cpp\nFind whether a number is prime or not.","tq2":"How can you optimise this code. Write the code .\nSQL query to find Nth highest salary. Given two arrays display the numbers that are present in both the arrays.\nDifference between stack and heap memory and in which cases are they used\n\nWrite a code to find all the Prime numbers between 1 to given number? Write a code to sort a given array? and also use HASHMAP to sort the array? Write a mysql code to find the list of employees whose salary is this much from the employee table?\nVarious debugging questions were there on topics like array,string\ncube root of number without using function\n\nDsa\n\nProgramming Qs - If a set of numbers is given then find out the maximum number that can be formed using that set.\nDifference between JVM and JRE\n\n\nPROGRAMS IN JAVA\nWrite a program to create a class and its object in python\nMerge sort\nExplain OOPs concepts\n\nCode for star pyramid in python\nGiven a number find the next whole squared value?","hq1":"Why do you want to join Amdocs.\nWhy do you want to join Amdocs?\nFamily background\n1.Where do you see yourself in 5 years. 2.Why do you want to join this company. 3.Who is your idol and why? 4.Are you wiilling to recolate.\nWhat are your interests? Would you like to reallocate? What is it that you like about the AMDOCS company? and WHY AMDOCS? Why should we choose you for the company?\nWhat are your strengths and weaknesses?\nQuestions about oops, dbms, java and many more\nIntroduction, family background, education, where do you see yourself in next 5 years, feedbacks\nReady to relocate to any of the location mentioned, ready to work in night shifts\nAre you flexible to work in any location?\nAre you willing to relocate, Tell about your family members, where do you live, your preference of location,\nFamily occupation and background\nIs relocation ok or not,have any offer in hand and asked grades of previous clasess\nWhy do you want to join, what do you know about the company, relocation\nARE YOU WILLING TO RELOCATE\nYour Family background , Preferred Job location\nWhy we should hire you?\nTell me about your weaknesses and strengths\nWhy do you want to join the company, Are you okay with relocation, What do you think your talent,Why do we want to hire you\nStrengths and weaknesses\nWhy do you wish to join Amdocs? Are you comfortable in working at the locations?","mrq":"\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n","logo":"https://seekvectorlogo.com/wp-content/uploads/2019/03/amdocs-vector-logo.png"},{"name":"American Express","tq1":"1. What are joins in DBMS? Illustrate some SQL joins. 2. Some OOPS questions\nWhat is the difference between GROUP BY, ORDER BY, HAVING and WHERE in SQL\nWhat is left join in SQL? If x and y have m and n data rows respectively, how many rows will be there after left join?","tq2":"\n\nHow do you decide which product to acquire out of the 2 given softwares you've used in your internship. What are the pros and cons and which software will you invest and why?","hq1":"Strengths, weaknesses, extracurricular activities, any successful non-academic endeavour that I've taken part in during my college years\nThere are 24 balls similar in shape, size and color. One of them is heavier than the rest. You are given a balancing scale (Weighing scale). What is the minimum number of readings you will require to find the heavier ball?\nWhat are your strengths and weaknesses?","mrq":"\n\n","logo":"https://1000logos.net/wp-content/uploads/2016/10/American-Express-logo.png"},{"name":"AppDynamics","tq1":"1) https://leetcode.com/problems/best-time-to-buy-and-sell-stock/  2) https://practice.geeksforgeeks.org/problems/left-view-of-binary-tree/1","tq2":"3) https://leetcode.com/problems/coin-change/  4) https://leetcode.com/problems/trapping-rain-water/","hq1":"5) Explain the job role? 6) Are you willing to relocate to Bangalore? 7) Are you comfortable with the compensation?","mrq":"","logo":"https://www.vectorlogo.zone/logos/appdynamics/appdynamics-ar21.png"},{"name":"Aster DM Healthcare","tq1":"Java, React, Spring questions, SQL, Data structure basic theories(LinkedList, arrays, graphs), Java streams, Java collections framework, LinkedList and graph based problem(asked approach), OOPS, OS, DBMS, microservices, projects, internship experience, work I did at my internship","tq2":"","hq1":"Tell me about yourself, situation based questions(leadership principles), conflict handling etc.","mrq":"","logo":"https://upload.wikimedia.org/wikipedia/commons/3/33/ASTER_DM_HEALTHCARE_LOGO.jpg"},{"name":"BAJAJ FINSERV LTD","tq1":"What was your research paper about and your profile seems to be of machine learning engineer, so how will it help you at Bajaj?","tq2":"","hq1":"What do you like about Vellore and how do you and your friends enjoy your time together after work?","mrq":"","logo":"https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Bajaj_Finserv_Logo.svg/2560px-Bajaj_Finserv_Logo.svg.png"},{"name":"Baker Hughes","tq1":"Technical interview 1 1) Introduction about me 2) In-depth discussion based on Projects from Resume code stack & and how to optimize it 3) Basic oops & data structures questions\nHow recursion works\nCyber security situation based question","tq2":"NA\nBasic unit of this automated work environment\nPillars of OOPS","hq1":"NA\nTell me about your project and experience\nTell us something about the company that we have not covered in pre-placement talk","mrq":"\n\n","logo":"https://assets.spe.org/cc/82/1cb0bcc09ac7f1a29c076813c81e/jpt-2019-new-bhi-logo.png"},{"name":"Bank of America","tq1":"Valid Parenthesis, Merge Sort, Arrays Based coding\n1)Self introduction, 2) preferred coding language, 3) OOPS Concept, 4) detailed explanation about my project, 5)SQL concepts\nOOPs  JDK JRE JVM Applet Exception handling  Acess specifiers static constructors  Diamond problem   Interfaces   SDLC   DBMS, OS,  ACID properties   Table joins: all possible ways to find repeating characters in a string\nwhat are the key features of aws\n1. Intro 2. How is preprocessing done in IoT 3. HTML headers  4. How to count the no. of records in SQL 5. Why is SQL called RDBMS 5. Command in java to connect to database 6. Explain polymorphism with examples 7. If I have heard of Cartesian in SQL 8. Classes in SQL 9. Different types of joins 10. Questions for him\nDifference between method overloading and overriding, bfs logic explanation, explaining 4 pillars of OOPS\nList of Python Libraries, Explain your projects,  Basic Java concept, basic sql concepts.\nThis round was purely based on my resume. Q1 Explain your role and project undertaken in internship. Q2 What were some of the challenges you encountered during your internship? Q3 What were your learnings during your internship? Q4 Discussion on projects done. Q5 I was asked to code a small segment of my project. (It was a C# MVC .NET project. I was asked to code something in .NET) Q6 Discussion on achievements. Q7 Discussion on certifications done. Q8 Write a C++ code to find factorial of a number. (Corner cases were taken into account). Q9 I was asked to convert the code written above into JAVA code.\nBenefits of using Java language\n There are N packages. You have been given dependency of each package. Return true if all packages can be shipped. Else False.  Input: P1 - P2,P3 P2 - P3 P3 - no dependency  Output: True  (Cycle detection in a directed graph)\nHow do you read input from a table? Explain any one join operation. Explain any one project. How do you input data while creating a website?\nEverything in resume and SQL question on INNER JOIN\nDifferent mobile applications\nQuery to write based on two tables and join operations. Basic coding questions and their logic to be explained and explain the time complexity. Oops questions and their example codes like polymorphism, inheritance,  exception handling.  Basic DBMS questions that included Sqlquery and how it was used in one of my projects.\nPython code for.palindrome\nTell me about a project you worked on and the challenges you encountered there.\nDifferences between ArrayList and Array, Differences between ArrayList and HashMap\nParenthesis question, what is your greatest achievement, your strength and weakness\nWhat is automatic garbage collector in Java?\n1) Write a program to print reverse pyramid using stars. 2) Write a program for Fibonacci series. 3) Write a program to retrieve 5th highest salary from database.","tq2":"Self Introduction, Projects, Oops, Multi Threading in java\n\nOOPs  JDK  SDLC , Projects, array coding\nexplain mergesort algorithm\n1. Questions based on Command line arguments 2. Internship based questions 3. Resume based questions\nProject related questions\nWhat is data science, data mining, dbms, sql, projects.\n\nWhat is Exception Handling in Java?\n\nExplain different types of database languages. What is the difference between abstract class and interface? How do you count all values in a table using SQL? Code for reversing a string. What is data warehouse? What are the different types of keys in dbms?\nBasic DBMS questions (ACID properties, JOINS etc) and questions on technologies used in projects\nDifference between them\nDifference between various languages and compliers, how compliers work and what are the new features that is different. Questions on projects and how they were ideated and implemted. Rapid round with many Oops and Dbms based questions. Questions about cloud computing as i choose it as my choice and how did i implement it in my projects. Simple DSA logics.\nSQL query for inserting ,deleting,modifying,altering values in the table\nWhich programming languages do you use to code in? What is your level of proficiency in them and how did you inculcate it in your projects?\nACID properties of a Database\nOOPS concept, hashmap, sql basic questions\nDifference between primary and unique key in SQL, and can we have multiple primary and unique keys?\n1) Query to find min and max salary in the database. 2) Sorting question 3) Prime number program.","hq1":"Self Introduction, Basic Hr\n1) Detailed Project Explanation, 2) write a code to reverse a given string, 3) remove a space in given sentence and print the word, 4) write a sql command to find count of repeated value, 5) how will you add a link in html.\nNA\nexplain a project you've worked on in detail\n1)Tell me about yourself and also explain your technical & training background. 2)What are your accomplishments  3)Why should you be a good match for this profile ?  4)What are your future goals & how do you plan to achieve them ? 5)Tell me about a time, when you had to learn something new & how you went about doing it ?\nTell us about your previous work experience and explain about the work done there\nWillingness to relocate.\nQ1 Introduce yourself Q2 Why do you think you are an ideal candidate for the company? Q3 Other basic HR questions Q4 Suppose you have a 3 liter jug and a 5 liter jug. The jugs have no measurement lines on them either. How could you measure exactly 4 liter using only those jugs and as much extra water as you need?\nHow you managed work load in previous internships\nN/A\n-\nNA\nAbout your project\nProject Management,  Team work based questions and flexibility working on projects.\nWhat are your strengths and weaknesses and how do you think you can make yourself useful to company\nWhat, according to you, is your greatest weakness?\nNA\nAbout my resume\nWhat are your career aspirations?\nWhere do you want to see in the next 5 years.","mrq":"\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n","logo":"https://1000logos.net/wp-content/uploads/2016/10/Bank-of-America-Emblem.png"},{"name":"Barclays","tq1":"My Interview started with self - introduction and projects done followed by a few technical questions related to strings and object oriented programming. Some of the questions asked to me in the Interview are :  1. Write the code to the given problem : Given two strings, return true if either of the strings appears at the very end of the other string, ignoring upper/lower case differences (in other words, the computation should not be \"case sensitive\"). Note: str.toLowerCase() returns the lowercase version of a string.  endOther(\"Hiabc\", \"abc\") → true endOther(\"AbC\", \"HiaBc\") → true endOther(\"abc\", \"abXabc\") → true      2. What is Polymorphism? Explain types of polymorphism in Java      3. What is Inheritance ? How can we achieve Inheritance in Java ?     4.  What is multiple inheritance?Does Java support multiple inheritance?     5. What is Multithreading? How do you achieve multi-threading in Java?    6. What is Encapsulation? Explain with an example","tq2":"","hq1":"I had only one interview which is technical + HR. The HR questions asked me are : 1. Where do you want to see yourself in the next 5 years?","mrq":"","logo":"https://logos-world.net/wp-content/uploads/2021/08/Barclays-Logo.png"},{"name":"Becton Dickinson","tq1":"Difference between abstract classes and interfaces?\nFibonacci series using DP and recursion","tq2":"Write code to implement polymorphism\nWhat is XGboost and MLP","hq1":"Where do you see yourself in 2 years and 5 years?\nWhat did you learn from previous interviews","mrq":"\n","logo":"https://1000logos.net/wp-content/uploads/2021/09/Becton-Dickinson-Logo-2003.png"},{"name":"BNY MELLON","tq1":"OS, OOPS, DBMS, DSA Live coding (Find the minimum length of af a subarray), Resume and projects.\nFind the frequency of all the elements present in array. Operating system questions and Projects","tq2":"Live coding DSA (Related to dynamic programming- subsequence), OOPS, Java comparison with python, Related to ML about the algorithms.\nSwap the contents of 2 array using object oriented programming concepts","hq1":"Challenges faced, Projects in the resume, How to manage a team in a hard situation.\nProject related questions, challenge faced, why should we hire you, carrier aspirations","mrq":"\n","logo":"https://upload.wikimedia.org/wikipedia/commons/thumb/6/61/Bank-of-New-York-Mellon-Logo.svg/1200px-Bank-of-New-York-Mellon-Logo.svg.png"},{"name":"BorgWarner","tq1":"It was about some java based questions, questions on projects I have mentioned in resume\nInterview questions from OS, Microcontrollers and C. Projects related to microcontrollers with sensors, actuators and other hardware.","tq2":"Some core questions based on VLSI\nGeneral hardware questions like: What concept would you use to control speed of DC motor, questions on analog and digital sensors, DAC, ADC and such concepts","hq1":"Question about what I know about the company, some C based questions\nAre you interested in hardware or software?. How do you keep up with current engineering trends in automobile industry?. Any experience working with embedded systems?. Participation in cultural and technical fests and competitions, co-curricular experience likewise.","mrq":"\n","logo":"https://upload.wikimedia.org/wikipedia/commons/4/4b/BorgWarner.jpg"},{"name":"Broadridge","tq1":"Regarding basic SQL syntax\nProject Related Questions, OOPS concepts- 4 pillars , 1 java coding and 1 sql query","tq2":"Regarding java\nMachine Learning concepts, Data structure questions","hq1":"What do you prefer core job or are you open to any stream\nTime management questions, My  Strength and weakness , 1 puzzle","mrq":"\n","logo":"https://www.workiva.com/sites/workiva/files/styles/co/public/images/logos/broadridge-logo.png"},{"name":"Cisco","tq1":"Island Traversal","tq2":"Cousins in a BT","hq1":"Why do you want to work at Cisco","mrq":"","logo":"https://1000logos.net/wp-content/uploads/2016/11/Cisco-logo.png"},{"name":"CITI Bank","tq1":"Basic Introduction; In-depth Projects/Internships discussions; Hobbies and Interests; History of Banking Industry in India; Experience with Product Management/KPIs.\nExplain polymorphism\nDescribe the concepts of oops. Define reference and pointers. What are the challenges working in a team. Explain a project you built.\nDifference between encapsulation and data abstraction with real life examples\nHow to code for Armstrong number?\n1.AWS services(cloud watch,s3,ec2,budget,cloud front,aurora DB, snowball) 2.projects 3. Oops\nFibonacci code ;Star pattern code;  dequeue and enqueue codes; Sql code for  max salary shown in the table;  Question on my project\nThe interviewer asked me the following questions in the technical interview round: 1. He asked me to introduce myself, and then asked me what are the things that I dislike. 2. Given an array with positive and negative integers, he asked me to print the Largest Sum Contiguous Subarray (Kadane’s Algorithm). In this, after writing the code on notepad, he asked me to dry run the code and explain how the code worked. 3. Find the unique number in an array consisting of duplicate numbers. I had to write the code for the same on notepad. Initially, I provided a naïve approach to solve this problem in O(n2) time complexity. The interviewer asked me to use another efficient approach and so I modified the code using HashMap. Further on, he asked to optimize the code again. Then, I provided the most efficient and optimal way of solving this problem using XOR operator. 4. He asked me to compare time complexity and space complexity of the aforementioned suggested approaches. 5. Next, he asked me a resume-based question. He asked me to talk about the Code for Good Hackathon that I had won this year and discussed about the problem statement that I was given. 6. Next, he asked me a scenario-based question. He asked me that if you are a manager, how would you manage employees who are highly skilled but are less participating in team work and are individualistic in nature. 7. Lastly, he asked me if I had any questions. I asked him some questions about Citi Bank.\nProject related questions, OOPs pillars with examples,Quick Sort,Bubble Sort,some JS questions\nQuestions on IOT (As I have mentioned it in area of interest) like what is IOT , How will it evolve in future ,problems in it and questions like that\nAbout web development and OOPS\nFundamental questions on my domain i.e. cybersecurity, questions on my currently favourite subject, in-depth questions on blockchain (as blockchain project was in my resume), questions on Java programming language (oops concept and explain each with code example), exception handling, random questions asked that what subjects I had in my 5th semester and how many credits have I completed till now.\nAbout the projects  and technical questions regarding projects\nWhy citi when you are from mech","tq2":"hashmap implementation internal. 3 room 3 switch puzzle. strengths and weakness. 1 project. internship exp. quick sort merge sort difference. real world applications of binary search.\n\n\nWhat is collections and what are the different types of collections and give examples\nHow to find the maximum/largest number from an array?\n\n\nThere was only one technical interview round. There was no second technical interview during the selection process.\nProject related questions(AI, ML Algorithms), Searching and Sorting Algorithms,Basic Java\nTheoretical questions and  queries from SQL, from basic like what is sql , how is it different from normal data base system  ,indexing, normalization etc. Queries involving joins ,subquery and window function. for some questions I had to form the table and answer the query.\nSoftware development life cycle\nQuestions on my blockchain project, how will you explain blockchain in layman terms, subjects of my interest - interviewer then picked MySQL and asked me to rate myself in MySQL then I had to share my screen and code queries for tables given my the interviewer on spot\n\nHow will you manage to learn coding","hq1":"No HR round\nWhat are your weaknesses and how do you plan to improve it\nIntroduce yourself. What languages do you know?\nWhat made you interested to join in this comapny and why should we hire you?\nWhy do you want to work in our company even though you have Aerospace background?\nIntroduction,strength,weakness,why this company?,where do you see yourselves in 5 years\nAbout myself ;    when dou you feel pressure\nThere was no separate HR interview round for us. However, some HR/behavioral questions were asked in the Managerial Interview Round. They are listed as follows: 1.My strengths  2.My weaknesses and how can I overcome them.\nSomething which is not mentioned in my resume that hr should know,Issues i faced in my club as a team lead,my hobbies,things I would like to change about myself,am I a hard worker or smart worker?\nTell me about yourself, what are your weakness, how did you overcoming your weakness, why citibank, what do you know about citi bank\nWhy do you think we should hire you\nTell me about yourself, what are your strengths and weakness: how you overcame them, how would you manage a conflict, what was the most difficult situation you faced and how did you resolve it, why Pune job location was my preference and will I relocate, what do you know about Citi bank\nAbout my strengths and weakness . How do I overcome my weakness.Why do I prefer Citibank and why not any other company.\nYour weakness, why do you want to work with Citibank","mrq":"\n\n\n\n\n\n\n\n\n\n\n\n\n","logo":"https://1000logos.net/wp-content/uploads/2016/11/Citibank-Logo.png"},{"name":"Cogoport","tq1":"What is a Join in SQL? List its different types.\nGiven file path for 2 files we are said to copy files from one path to another. We were expected to write a pseudo code for that.\nFind power of a number without using inbuilt function with optimization, Design database for postal code and get details of continent, country, State, City, Town, Questions in BST and react js, Rotated string\nLeft View of Binary Search Tree","tq2":"Write a code to traverse through a linked list and print the last elements value.\nWhat is static key word and discussion about projects\n\nReverse a Linked list, with cycle detection.","hq1":"Why should we NOT hire you and one thing that you want to change in yourself\nWhy do you want to join the company, what if you get rejected in this interview, tell about your top 3 skills\nWhy do we need to hire you and resume based questions\nWhy should we not hire you?","mrq":"\n\n\n","logo":"https://uploads-ssl.webflow.com/5e57ba59552cf400c593fd16/5e7fbdeb3efd72446c9d54b7_5e7fbc1243a59ded3e14959c_placeholder.jpeg"},{"name":"Databricks","tq1":"Major discussion on Projects. Sql inner join query, find the 3rd highest salary in given database using nested query/rank.  Outputs after left join, right join after joining the given two tables.","tq2":"What is Hadoop Framework? Sql inner join outputs. What is cloud computing? Basics of aws. What is Big data and the steps of processing big data?","hq1":"What do you know about the company? Consider a situation, you’re working with a worker whose nature is rude, how will you handle this situation? Suppose two student get selected for the role and after 6 months other guy get promoted but not you, so how will you deal with this situation and what will you do?","mrq":"","logo":"https://upload.wikimedia.org/wikipedia/commons/thumb/6/63/Databricks_Logo.png/800px-Databricks_Logo.png"},{"name":"Dish Network Technologies","tq1":"Find transpose of a matrix (inplace)\nTell me about yourself, questions from projects, coin change problems, two logical reasoning questions\nImplement a queue with given size and if the queue is full the person has to wait for given time (using thread concept), find the number of vowels in a string and reduce the time complexity by comparing the character with vowels and reducing the time complexity by comparing ascii values, given an array of 1000+ strings sort the array based on only first  character\nQUESTIONS BASED ON JAVA OOPS,DATA STRUCTURES,THREADS,AND LOGICAL QUESTIONS","tq2":"DBMS related questions on SQL like views, triggers\nNA\n\nGENERAL ROUND LIKE MY INTRESTS AND SOME BEHAVIOURIAL QUESTIONS AND ONE SMALL PROGRAM ON BINARY TREE MORE LIKE MIRROR TREE","hq1":"Family background, Why Dish Network?, your interests\nTell me about the company, tell me about yourself and about your family, why do you want to join dish networks, where do you see yourself in next 5 years, my strength and weaknesses, extra curricular activities,\nGiven 10 red and 10 blue balls, if 2 balls of different color is picked red ball is replaced and if same balls are picked blue is replaced, what is the color of last ball, implement stack using queues, why this company,higher studies?\nFAMILY BACKGROUND QUESTIONS AND QUESTIONS ON FIELD OF MY FATHERS BUSINESS SO THAT HE WILL BE GETTING TO KNOW WHETHER I HAVE A GOOD KNOWLEGE ON WHAT IS GOING AROUND DAILY REAGARDING THAT BUSINESS AND COMPANY MOTIVE AND SOME HE ASKED WHETHER I ATTENDED PRE PLACEMENT TALK AND ASKED WHAT HAPPENED IN PPT","mrq":"\n\n\n","logo":"https://logos-world.net/wp-content/uploads/2021/08/DISH-Network-Logo-2019-present.png"},{"name":"Eli Lilly","tq1":"Explain about your recent projects ? , Basic questions on SQL, Python, Cloud(AWS).\nI was asked questions related  to python, javascript, Databases, SQL,cloud and data structures. 1) explain python's global and local variable in terms of their scope in a program. 2) arguments vs parameters in python functions, and what is application of help function. 3) prototype inheritance in js and it's advantages over oops based inheritance. 4) 1 basic SQL query, 1 medium SQL & SQL joins were asked 5) explain various paradigms of databases & NoSQL vs SQL, also asked on basic premise of cloud like AWS. 6)Explain Hashmap vs dynamic arrays like python list (1 difference and 1 similarity)  7)1 easy dsa question based on Hashmap's application of storing frequency as values of keys.(asked to just verbally explain pseudo code or steps of algorithm) 8)Asked about projects that i mentioned in the resume in detail, projects were based on Django & Spring Boot.\nExplain the concepts of OOPs\nHow to remove duplicate files in cpp using stack and how to store duplicate characters in strings and which dat structure is used for that.\nWhat are your projects and what tech stack did you use?\nOperating System based and Programming related\nPrint palindrome of the string in python, check number is prime number or not in python\nSwap 2 numbers without third variable(mathematically).","tq2":"Asked my role in Deep Learning project which mentioned in my resume and questions on SQL mainly on topics like joins.\n\nWhat are the different types of normalizations and how are they interconnected\nWhat is optional chaining, hooks,usedState,useRef in ReactJS and count maximum number of tiles ( basically it's a dp problem given in leetcode)\n\n\nDelete vs truncate in SQL, What is DDL,DML in SQL, is SELECT DDL or DML?, Reverse a string in Python\nDictionary Questions(Python). Difference between List and Tuple and few machine learning Questions","hq1":"Asked about my online car showroom project, and why do want to join our company?\nMy 2nd round was both Hr round + Manegerial 1) I was first asked to introduce myself  2) I was asked about my 2 favourite projects that I did during my BTech 3) I was then asked about Eli Lilly in general and what they do, and how and why do I resonate with what they do. 4)High level discussion on how I contributed on my projects, my approach, difficulties I faced etc 5) then I was asked about my interests in various technology domains. 6) Discussion on Data analytics etc as the fundamental need of pharma industry and data related roles. 7) Also I was asked about application of blockchain, data mining in supply chains of pharma industry.\nIf you are inclined towards technical domain then why not any other product based company? why Eli lilly?\nThere are many companies like MAANG , why you choose our company only?\nDo you think you're the right person for the job?\nWhat do I identify myself more? As a leader or a team member\nNumber of petrol pumps in india (guesstimate)?,Why do you want to join Eli lilly?,\n5 Qualities about yourself","mrq":"\n\n\n\n\n\n\n","logo":"https://1000logos.net/wp-content/uploads/2020/03/Lilly-Logo.png"},{"name":"Ensuredit","tq1":"Access modifier and their types and 4 pillars of oops and one coding question regarding finding angle between minutes hand and hours hand","tq2":"Regarding Project","hq1":"Let me about yourself","mrq":"","logo":"https://media.licdn.com/dms/image/C4D0BAQHOfYPJflVCsw/company-logo_200_200/0/1657003760253?e=2147483647&v=beta&t=HdgwPknTTDhdToGSGWNDGLprNjgNawjR_Cj87P-91mk"},{"name":"Ericsson","tq1":"About the projects,why do we use static for main method,oops basic concepts,programs on factorial,fibonacci\nIntroduce yourself, In depth questions based on projects, one linkedlist question, general discussion on technology interest mine was cloud computing, one puzzle question - make 4L from 5L and 3L water jug\nIntroduce yourself and projects ,oops concepts and java code\nA lot of questions were based on Java (as i said i'm more proficient in that) ->  most questions were based on exception in java, then try throw catch and detailed questions on every use case, then question on OOPs, again detailed questions on every case, questions on my projects and then some more questions on SQL\n1) Explain collections in java  2) Explain polymorphism, encapsulation, abstraction and Inheritence 3) Write a program on how to find missing number from a series of number 4) What are the different types of keys in SQL 5) Difference between unique and primary key 6) Explain about the projects you have done. 7) How to find second maximum in MySQL\nSelf Introduction ? what is polymorphism? Code for Method overlading? Write a code  to create a table by using html and CSS? What is DBMS?\nWhat is polymorphism with real examples?","tq2":"\n\n\nno technical interview 2, direct managerial/hr question\n\n\n3 questions related to constructors","hq1":"All the details mentioned in resume,achievements,how are you different from other candidates according to the things mentioned in resume,\nGeneral disussion about myself and my interest in technology, any problems i faced during my college days, how i overcome this problem, why should we hire you?, strength and weakness\n-\nSo, I had managerial/ Hr together. She asked basic questions like trying to make me comfortable like how are you and how was my previous round, (also she was impressed because I was in formal attire) then she asked about my projects and what I learnt from it, how was my overall experience, and asked me about development cycle then which role would i prefer i get the offer, some more basic questions\n1) Tell me about yourself 2) What was your favorite question from technical round 3) Are you a hardworking person or smart working person 4)Where are you from 5) Can you share the most memorable day in your college  6) Would you like to do work from home or work in physical mode 7) Explain about a setback you recently had\nThere is no particular round for Hr , In Managerial round itself they asked Hr questions  . He ask me about my personal info and  enquired about number of interviews I gave until now and he question me why wasn't I not selected  and finally end with the relocation question.\nWhat are the difficulties you faced during team work and how did you overcome it?","mrq":"\n\n\n\n\n\n","logo":"https://1000logos.net/wp-content/uploads/2021/05/Ericsson-logo.png"},{"name":"Ericsson (R&D)","tq1":"Garbage collection, memory management, oops, abstract keyword in java\nIntroduction(1 min) , Projects brief(5 mins),Domain Related Questions on cyber security(OWASP,Best encryption techniques etc),  Computer Science Domian Questions(Computer networks-OSI Layers,What is Router and how does it work),OPPS concepts(Why do we need OPPS, pillars of oops) Data structure - Binary tree Complexity\nFinding missing and repetitive term in the array\nFind peak elements in the array\nWrite code to find the peak of an array.","tq2":"\nNA\nSql\nAbout Deep learning\nMachine learning and deep learning .1.)How does CNN work?  2.) Why epochs increase the accuracy in deep learning? 3.) How does random forest give different result than decision tree ?","hq1":"where do you see in next 5 years, location preference, projects mentioned in the resume\nThere was no HR (After tech only Managerial interview)\nWhy do you want to join ericsson?\nWhat do you expect from Ericsson\n1.) Why do you want to join our company.","mrq":"\n\n\n\n","logo":"https://logos-world.net/wp-content/uploads/2020/12/Ericsson-Logo.png"},{"name":"Expedia Group","tq1":"Projects, Adding two numbers given in linkedlists and returnng a linkedlist, merge two sorted linkedlists(iterative and recursive method)\nQ1. For an array of n integers, arr[n], perform the following operations up to some integer k times. (i) Choose an index i such that 1<i<n. (ii) Replace arr[i] with arr[i]x2. The or-sum is the bitwise-or of all elements in the final array after the operations. Return the maximum or-sum possible. Q2. Given a non-empty array nums containing only positive integers, find if the array can be partitioned into two subsets such that the sum of elements in both subsets is equal.","tq2":"\nQ1. Rearrange characters in a string such that not two same characters are adjacent. Q2. Delete the nth element from the end of the linked list.","hq1":"Projects, 3Sum, Hackerrrank question, some behavioural questions\nHow would you manage your work-life balance if you start missing out on to-do lists.","mrq":"\n","logo":"https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/Expedia_Group_logo.svg/1200px-Expedia_Group_logo.svg.png"},{"name":"ExxonMobil Services and Technology Limited","tq1":"Tell about the project in which you faced the most challenges. Follow up questions.\nExplaining projects in resume (2 specifically were asked), what is cloud computing, what is bash/power bi, scenario-based question on looping statement, question about collections(package) in java, do you know linux\nTell all the possible ways in which we can find Maximum element in an array without sorting the array.","tq2":"Why is Java called platform independent? What is inline function? How is Java different from Python? Why are destructors required?\n\n- What is STL in C++, OS related- What is demand Paging, DBMS related questions- SQL Vs MySQL(Explained with help of queries). Array related more technical questions","hq1":"What is the definition of teamwork according to you? Why ExxonMobil?\nWhat do you know about ExxonMobil, why should we hire you, If you do not like your job role how will you deal with it\nWhy do you want to join ExxonMobil?","mrq":"\n\n","logo":"https://mms.businesswire.com/media/20210901005307/en/520773/23/exmo_red.jpg"},{"name":"Forma.ai","tq1":"It was a technical case study. A scenario about a paper company was given with salesperson data and their incentives. Question were based on that.","tq2":"","hq1":"Did you face a situation where you and your teammate were of different opinion. If so, how did you tackle it?","mrq":"","logo":"https://seeklogo.com/images/F/forma-ai-logo-FAA7E46033-seeklogo.com.png"},{"name":"Fractal Analytics","tq1":"Resume based , Sorting algorithms, Python questions\nMy experience, knowledge and contributions to GITHUB repositories.\nBasic concepts of Object Oriented Programming\nProject\nWhat is normalisation ? Different types of normalisation forms in DBMS? What is DML language? What is Big Data? What are 5v's?   What do you mean by HDFS and Map reduce ? What are the different joins and data types in SQL? Query to find second highest salary? What is AWS and what are the different services present? What is meant by oops?  Pillars of oops with real life examples?\nAbout project, basic Java questions\nAsked some basic questions on SQL.","tq2":"Resume based, first missing positive number, DSA\nWhat are the Major Projects done by me and how I have evolved and learnt from the project building phase.\n\n\nTell me more about your projects? What type of dataset have you used? Your contribution? Why these models are used in your projects? How did you process your data set?\nInternship and questions from that\nAlso asked the if I know the prerequisites for the post that I'm going to try for. So you should know the prerequisites even if you do not know them in detail. That gives them the confidence that the student is very much keen to join the company and has done some prior research. Cuz that was the case with me.","hq1":"Recent experience, Achievements and standard questions\nMy future goals and Aspirations. What difficulties I faced doing my projects and being a Team leader.\nWhat are your Strength and Weakness\nWeaknesses and team based project scenarios\nTell me something about yourself which is not in resume? Why did you choose this role? Why Btech? What did you like and dislike about your previous internship? What was your role in projects?\nSituation based questions and our approach to that specific problem.\nAsked to tell me about myself. Do I consider myself a team player or a team leader. Also asked why I'm choosing to switch fields when I'm from Bioengineering and this is a pure analytics based company.","mrq":"\n\n\n\n\n\n","logo":"https://fractal.ai/wp-content/uploads/2018/03/Fractal-Logo-WithBL.png"},{"name":"Genpact","tq1":"Describe my project and cross questions on my naruto jutsu prediction project,Importance of feature vectors while classifing a image\nQuestions are related to OOP's concept , basic coding questions like reverse of array or find 2nd largest element of array , data types , variable explanation with examples, explain java syntax , sql questions , differences between dbms and rdbms with examples , sql queries , dbms questions.\nHow to create a table in SQL\nDifference DBMS rdbms","tq2":"Why did i chose lstm over rnn in my stock prediction project, another question on roc curve and recall and precesion like- when recall and precision are equal how is accuracy. And a question on sql joins gave two tables and did outer join and ask me about output.\n\nDifference between char and varchar\nConnect front end back end","hq1":"I will give you 3 questions and answer each in 180 sec. 1) what do you want to join genpact. 2) why do we have to chose you over others. 3) where do you see yourself in 5 years?\nBasic introduction and nothing more\nWhy do you choose vit? Family background ? What are your hobbies\nTell about yourself","mrq":"\n\n\n","logo":"https://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/Genpact_logo.svg/2560px-Genpact_logo.svg.png"},{"name":"GSK","tq1":"How much do you know in python and sql","tq2":"Aptitude problems, find error on the given table, logical reasoning and algorithms","hq1":"Introduce yourself, why do you want to be recruited by GSK, do you find any faults with our current selection process and any suggestions for its optimization, higher education goals, what do you think you job role would teach you","mrq":"","logo":"https://upload.wikimedia.org/wikipedia/en/thumb/a/a6/GSK_logo_2014.svg/1189px-GSK_logo_2014.svg.png"},{"name":"Havells","tq1":"Given data and fetching data in Java script, implementation of any sorting algorithms, finding second highest, nth highest in sql\nExplain about inheritance with a real time example. Explain the types of inheritance. Questions were fully based on OOPS concepts. Explain abstraction, polymorphism.","tq2":"Array question, Projects: Type of attacks and top 10 attacks, How do you implemented\nExplain about project. Find duplicate in a string. Reverse a linked list.","hq1":"No Hr interview\nNo HR round","mrq":"\n","logo":"https://upload.wikimedia.org/wikipedia/en/thumb/5/57/Havells_Logo.svg/2560px-Havells_Logo.svg.png"},{"name":"HCL","tq1":"IT solutions involved in your institution","tq2":"How IT solutions makes things easier in day to day life","hq1":"Where do you see yourself in 5 years ..?","mrq":"","logo":"https://download.logo.wine/logo/HCL_Technologies/HCL_Technologies-Logo.wine.png"},{"name":"Hewlett Packard Enterprise","tq1":"What is a REST API\nBasic concepts like scheduling algorithms, operating systems, networking, debugging question.","tq2":"Which data structure will be used to find one web page out of a 1000 webpages ? (HashMap)\nDSA Coding questions - count of number of words, length of longest substring, median of two sorted arrays.","hq1":"Why would you want to work for our company?\nIntroduce yourself, interests and hobbies etc.","mrq":"\n","logo":"https://1000logos.net/wp-content/uploads/2021/09/HPE-Logo.png"},{"name":"Hindustan Unilever Limited","tq1":"A GD was held and then the final Personal Interview. Questions asked were based on my resume. Explain your Project, What is Cloud, What is IoT and Give a use case of IoT for HUL.","tq2":"There was an initial shortlisting followed by another shortlisting based on the filled Application Form.","hq1":"What are the challenges that you faced? Why Unilever?","mrq":"","logo":"https://cdn.sanity.io/images/92ui5egz/production/ba0e8bde098aa99fc24c647fe3cb85affb7243bd-1920x1080.jpg?rect=0,36,1920,1008&w=1200&h=630&fm=jpg"},{"name":"Hitwicket","tq1":"Favorite data structure and it's implementation.","tq2":"What is REST API?","hq1":"What makes you an ideal candidate?","mrq":"","logo":"https://res.cloudinary.com/crunchbase-production/image/upload/c_lpad,f_auto,q_auto:eco,dpr_1/d0rnjwg4nqfdntf1d3i5"},{"name":"HONO.AI","tq1":"What is Singleton class?Write the code","tq2":"What is cluster index and non cluster index? write sql query","hq1":"what are your strengths and weekness?","mrq":"","logo":"https://etimg.etb2bimg.com/photo/91586371.cms"},{"name":"IBM","tq1":"What is friend function\nNA\nWhat is a Structure in C++?\nProjects, resume based\nElaborate on the phases of Software Development Life Cycle.\nSQL- given two tables with table-1 having name of employees and month when they were recruited and table2 with salary of employee. Find the data of employee who were given salary in 6 months period","tq2":"what are joins and their types\nNA\n\n\nElaborate on the projects and domains that you have worked on.\nPuzzle questions","hq1":"Describe how you are a team player\nYour role and contribution in a team project, and how would you manage to get feedback and ideas from a team member who's feeling shy to speak in group if you are the lead of a group.\nName some problems you have faced in your life and how you Overcome it? What do you Know about IBM?\nWeaknesses, difficulties faced in college and how you overcame it, strengths, attitude towards change\nAre you a team player.\nWhy do you want to join IBM, if IBM is already an established company what would be your contribution, if you get selected in testing instead of analyst what will you do","mrq":"\n\n\n\n\n","logo":"https://www.ibm.com/brand/experience-guides/developer/b1db1ae501d522a1a4b49613fe07c9f1/01_8-bar-positive.svg"},{"name":"iDrive","tq1":"How Java differs from C++, Java classes, interfaces and abstract classes\n1). Explain us about any one project that you did and you think it made some impact at any level.","tq2":"Exception Handling, Object creation methods, constructors and equals method\n1) What do you mean by polymorphism , its types and explain with example.  2) DSA question approach how you will solve it (algorithm) : reverse a string,  print each digit of a number and its modification ques.    3) What is object slicing?   4) How run time polymorphism works internally explain.  4) Difference between C++ and java.  5) What are pointers and it's types?","hq1":"Logical riddle question, family background, passion and ambition\n1) What you know about iDrive?","mrq":"\n","logo":"https://w7.pngwing.com/pngs/737/493/png-transparent-remote-backup-service-cloud-storage-idrive-inc-cloud-computing-blue-text-trademark.png"},{"name":"J P Morgan Chase & Co.","tq1":"A case study was given beforehand and we were asked to read it through and prepare answers for the questions mentioned in it. 1. The interviewer asked questions based on the case study and assessed us by giving different scenarios. 2. Then we discussed about few of my projects.\nExplain KNN,difference between merge and union,difference between truncate and delete,few ques based om case studies\nWrite a program to print all prime numbers in a given range. What is the probability of selecting 2 girls from 15 girls and 1 boy from 10 boys in a class. 3 case study questions.\nTell me about yourself, about projects, handling missing values, decision tree, imputation methods, outliers\nDifference between R-squared and adjusted R-squared; Difference between Ridge and Lasso Regression\nA,B,C,D are columns. We need to sort A in asc and B in desc? Which sort will you use for efficient approach and why?\nProject Explanation, Decision Trees Algorithm, SQL query to select employees who are managers","tq2":"1. When a dice is rolled twice, what is the probability that you never get 5 on the dice. 2. The people of a community keep having children up until they have a boy - what will be the female to male ratio. 3. Discussion about my projects\nExplain logistic regression,explain linear regression,why linear regression over logistic regression,what is variance standard deviation,explain conditional probability\nSql query for getting the name of student getting highest and 2nd highest marks in class. Write a program to print the name of all person who are living in delhi in a single line. Difference between list and tuple.\nConditions probability, definition of data warehouse, about resume\nWorking of ML algorithms like RFR, SVM and AdaBoostClassifier\nCan we use Union if the number of cols in 2 tables are different? If not which function would you use?\nCase study, Probability questions, logistic regression","hq1":"1. How was the interviews - give us feedback. 2. Are you willing to relocate ? 3. What are you most scared of for your move from college to an internship ?\nWhy JP Morgon?,what are the challanges u face while to take up new job\nWhy are you choosing Jp Morgan over all other companies? What is the thing you think as your biggest weakness?\nYour strength, weakness, about non academic activities\nWhy join JP Morgan; Kind of career in next 5 years\nWhat is another role which you are interested in?\nWilling to relocate, okay to work in different time zones","mrq":"\n\n\n\n\n\n","logo":"https://media.designrush.com/inspiration_images/134937/conversions/_1511454480_993_jpmorgan-mobile.jpg"},{"name":"JLL Technologies","tq1":"Code for outer join, inner join in dbms\nCan primary key be changed in an RDBMS\nAbout my projects and internship and concepts related to them.\nOOPS CONCEPT","tq2":"\nDifference between SQL and NoSQL DBMS\nSql query\nJAVA CODING QUESTION TO SORT A LIST","hq1":"Reasons you opted jll, area of interets\nDifference between listening and hearing skills\nDifficulties faced and how did i over come related to my engineering experience.\nTELL ME ABOUT YOURSELF, CAREER ASPIRATIONS, HOW WOULD YOU RESOLVE CONFLICTS,","mrq":"\n\n\n","logo":"https://cdn.bulldogjob.com/system/companies/logos/000/002/751/original/JLL_Technologies_Logo_blk.png"},{"name":"Kimberly Clark","tq1":"About my ml project fake news detection","tq2":"Python basic functions and a coding qn to remove spaces in my name","hq1":"Whether I'm okay to relocate to Bangalore","mrq":"","logo":"https://companieslogo.com/img/orig/KMB-f97a2317.png?t=1634121121"},{"name":"Kinaxis","tq1":"1) Introduce yourself. 2) Resume Discussion. 3) Past Projects discussion. 4) Puzzles - Given 2 bags, each containing some red and blue balls, what is the probability to select 1 red ball and 1 blue ball. 5) Coding - Write a code to count the number of vowels and consonants from a given string sentence. 6) How would you approach a case for testing a calculator application.","tq2":"1) Introduce yourself. 2) In-depth Projects discussion along with explaining the concepts and cross-questioning. 3) Case Study - How would you approach and what all test cases would you make for testing an USB cable. 4) Coding - Program to find the substrings in a string subject to given conditions. 5) Any further questions - Business functioning, pillars of the company, company revenue growth aspects, company culture discussion.","hq1":"1) Introduce yourself. 2) Past leadership roles experience. 3) Why do you want to get into IT sector while it's not performing well globally. 4) Situational Questions - How will you manage different POVs and opinions clashing in a team. 5) How will you adjust with people and culture moving to Bangalore. 6) Company growth aspects discussion.","mrq":"","logo":"https://www.logo.wine/a/logo/Kinaxis/Kinaxis-Logo.wine.svg"},{"name":"Leadsquared","tq1":"Describe possible test cases for an elevator?","tq2":"1.Explain test cases for checking an authentication for application user login etc? 2.differnt types of testing?3.explain about sql injection attack  and its prevention?","hq1":"What is your favourite book and explain its summary?","mrq":"","logo":"https://images.g2crowd.com/uploads/product/image/social_landscape/social_landscape_0ce786f0da74db088f8921e3f594a0d4/leadsquared-sales-mobile-crm.png"},{"name":"Mad Street Den","tq1":"Multi tasking vs Multi programming\n1.Tell me about yourself  2.Explain Projects mentioned in Resume  3.What is OOPS 4.Scenario Based Coding Question ( Validate username and password of User ,  for Eg:- Input: username - Ashish  password - hsihsA@6 Output: Valid Explanation: If the username is xyz then password should contain the reversed series of letters of username along with '@' and count of letters in username so the password should be zyx@3 )  5.Mention some test cases of the scenario based Question and explain them.","tq2":"Printing frequency of each character just after its consecutive occurrences\n1.Tell me about yourself  2.Explain Projects mentioned in Resume  3.Why Gaming 4.Make a prototype of a website similar to BookMyShow and explain about all features and functionalities 5.Scenario Based Coding Question ( File Rename System ,  for Eg:- Input: Sample.txt Output: Sample(1).txt Explanation: Check if a file already exists in the database; if so, rename the file and add the file number to the end of the file name.","hq1":"How soon can you learn a new programming language\n1.Why Mad Street Den","mrq":"\n","logo":"https://media-fastly.hackerearth.com/media/companies/6f7af12-_Mad%20logo.png"},{"name":"Mercedes-Benz Research & Development India Pvt. Ltd","tq1":"Explain about transformers,controllers\nAptitude, coding questions\nWhat are data types\nCollection and Lists in Java\nResume based questions: Internship based questions, the work I did in all the internships I mentioned in my Resume, Explanation about the tech-stack mentioned in each of the project. How does a JVM work internally? What is thrashing in OS? explain about overloading and overriding. Explain about oops concepts.","tq2":"about back emf\n\nDifference between list and tuples\nFinal, Finally, Finalize real world examples\nFind the maximum of 2 numbers without using loop or if-else statement.","hq1":"Family background, Relocation\nAbout the candidate, weaknesses, learnings\nNA\nOne like and dislike of yours about the company, product or their presentation\nWhy do you want to join our company? Why should we hire you? What are your weaknesses and strengths?","mrq":"\n\n\n\n","logo":"https://image3.mouthshut.com/images/imagesp/925607046s.jpg"},{"name":"Microchip Technology Inc","tq1":"What is gray code,How to generate gray code from binary and vice versa? What is 8421,What is weighted and non-weighted binary code? Implement AND gate using 2 to 1 mux? Difference between synchronous reset and asynchronous reset with Verilog code? Difference between RAM and ROM as memory? Implement d flop using t flip flop and vice versa? What is a ring counter?\nBasic and intermediate question on digital logic design, combination circuits, sequential circuits questions, flip flops, delays, clocks, registers, mux implementation for logic design, FSM\nBasic sorting, string, core CS questions, some questions from areas of interest\n8051 Assembly Language programming , type qualifiers in C , Scope of functions and variables in C , regarding my 8051 project","tq2":"Explain VLSI design flow? Explain the concept of MOSFET? Difference between blocking and non-blocking assignments? What is a buffer and its uses? What is a decoder and how can it be constructed using demux? What is PLD? What is setup time and hold time and why are they important?\nBasic and intermediate questions on analog circuit designing, op-amp, nmos pmos different region of operation, nmos as amplifier, small & large signal analysis, differential amplifiers, current mirror,\nSame level as tech round 1 and questions were along the same line as that of round 1\n8051 Serial Communication, Computer Organization and Architecture,  SPI , I2C , UART communication protocols, Advanced C pointers concepts","hq1":"What are your thoughts on work from home? Do you prefer work from home or work from office? Why did you choose this job preference?\nThere was no typical HR questions, Directly the interviewer congratulated and then doubt clearance like relocation, CTC break discussion, joining.\nYour interest, family background, willing to relocate, willing to work oncampus\nHave you attended any other companies interviews and if you attended why were you not able to clear them","mrq":"\n\n\n","logo":"https://upload.wikimedia.org/wikipedia/commons/thumb/c/ca/Microchip-Logo.svg/1200px-Microchip-Logo.svg.png"},{"name":"Microfocus","tq1":"Describe all components of OOPS with examples, Explain OSI model, Describe your projects,Find the last palindrome date before 10/02/2001\nBasic concepts of oops,os\nInterchanging values of two variables without using another variable (and also using xor)","tq2":"\nConvert integer number to Roman , basic Linux questions\nSituation based question about macros, Doubly linked list","hq1":"Tell me about yourself, Cleared queries on the information about the organisation\nAbout family background , hobbies , projects\nRelocation flexibility and family background","mrq":"\n\n","logo":"https://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/Micro_Focus_logo.svg/2560px-Micro_Focus_logo.svg.png"},{"name":"Mindtree","tq1":"Difference between list & linked list","tq2":"","hq1":"Apart from studies, what do you like best in your College?","mrq":"","logo":"https://www.pngfind.com/pngs/m/609-6096249_mindtree-logo-mindtree-logo-png-transparent-png.png"},{"name":"NatWest","tq1":"Types of Joins, how they are used and their syntaxes in sql\nWhat are registers in C++?, How is agile model better than other traditional SDLC models?","tq2":"\n(Questions focused mainly on projects) Describe one of your project in brief. What challenges did you face during the process of making?, How did you overcome them?","hq1":"What are your Strengths and Weaknesses?\nWhat would you prefer, working in a team or working individually? And why?","mrq":"\n","logo":"https://logos-world.net/wp-content/uploads/2021/02/NatWest-Logo.png"},{"name":"Neilsen IQ","tq1":"Assume two tables from yourself and show different types of sql joins.\nCS fundamentals - DBMS, OS, CN, OOPS, Web concepts","tq2":"What all shortcuts are known to you in Excel?\nCoding question on DSA. Binary Tree, Linked list, arrays","hq1":"What would you consider yourself- lone wolf,thinking elephant?\nNA","mrq":"\n","logo":"https://nielseniq.com/wp-content/uploads/sites/3/2020/10/NielsenIQ-large-2.jpg?resize=1024,317"},{"name":"Osmosys Software Solutions","tq1":"Create shopping complex, Core Java Questions, Get and Post, Run medium level Programs on IDE","tq2":"Run Project and explain","hq1":"Why do you want to work here","mrq":"","logo":"https://media.glassdoor.com/sqll/1368967/osmosys-squarelogo-1576487760445.png"},{"name":"Ozone Cloud.","tq1":"1. Questions based on projects. My 2 projects were based on AI-ML thus I got Qus like: - a. What is Backpropagation? b. What is Optimizer? c.  What is Logistic Regression? (As I have mentioned logistic regression in my resume) 2.\tThen they asked me about core CS subjects like OS. One should have a good command of CS fundamentals. Qus like: - a. process vs thread?  b. how does a child process get an idea about who is its parent? (ans-> getppid()) c. segmentation vs paging? d.  What is interrupt? Try to explain with an example. 3.\tThen qus from OOPs, one should have good command over oops. (4 pillars of oops deep dive qus.) 4.\tThen some basic javascript, and HTML questions.","tq2":"","hq1":"1. Self Intro 2. Typical HR qus, how are you different from others? etc.","mrq":"","logo":"https://w7.pngwing.com/pngs/623/976/png-transparent-hot-tub-ozone-computer-icons-oxidizing-agent-water-ozone-text-trademark-logo-thumbnail.png"},{"name":"PepsiCo","tq1":"Explain any technical project you have done?   What are the technologies used? What are the difficulties faced when you were doing your project?\nProjects explanation\n1.Explain about your projects in detail. 2.What is logistic regression 3.What is bagging and boosting 4.what is time series analysis  5.Give a situation where you would use hybrid cloud  6.What are the kinds of delivery models in cloud computing?\nTech Stacks Used in Your Projects\nExplain the system design of a streaming platform\nWhat is the suitable Backend software suitable for a ML project to scale up?\nself introduction, about the technical club mentioned in resume\nquestions were asked based on aws cloud- storage types,computing types, pricings.\nWhat is heuristics in AI\n1. What is multithreading and how is it used 2. Why do we do normalization in machine learning 3. Difference between R^2 and adjusted R^2 4. Given the bell curves, name the distribution","tq2":"\nwhy pepsiCo\n\nFlutter Concepts\nExplain the process of data preprocessing\nExplain cloud computing software you know?\nAbout your projects\nquestions were asked based on aws cloud- regions, availability zones and data centers,sns vs sqs. and also some questions based on networking(tcp,udp protocols).\nScenario based SQL query , Inner Join, Outer Join , Cross Join\n5. What would you choose between R and Python and why? 6.how will you decide which user story is effective 8. Explain agile methodologies and what is learning from the course which you did in your university","hq1":"What do you know about Pepsico? Why do you want to join Pepsico?\nstrengths, Where do you see yourself in 2 years.\n1.Tell me about your family 2.where are you from  3.Are you willing to relocate to hyderabad  4.tell me a situation where you have used one of your softskills\nHow was your experience of Selection Process , What is Difference between character and behvaiour\nWhich principles of pepsico align with your personality?\nAre you able to relocate to the Hyderabad or not?\nif shifting to new place was okay\nIntroduction about yourself,resume.\nIf you were asked to explain how you are as an individual, how will you present yourself\n1. Tell me a scenario where you showed your leadership skills 2. What was the difficult situation you learned from that situation? 3. What are the efforts you put and did you master any of your hobbies","mrq":"\n\n\n\n\n\n\n\n\n","logo":"https://logos-world.net/wp-content/uploads/2022/03/Pepsico-Emblem.png"},{"name":"Piramal","tq1":"What are decision trees, what is the difference between variance and bias, what are the various classification models,","tq2":"SQL query to print second largest record, SQL query to print 5th row, pandas code for getting a row entry, questions around projects in resume","hq1":"Questions on projects and use of machine learning models, riddle to get the time to cross a circle of radius xcm if speed halves at every consecutive step","mrq":"","logo":"https://mma.prnewswire.com/media/659399/Piramal_Pharma_Solutions_Logo.jpg?p=facebook"},{"name":"Policy Bazaar","tq1":"Technical: 1) Describe about any major project 2) How the app (MERN stack project) is different from the other similar existing apps ? 3) What are the different components in my project 4) How does the data flows through out the project, like how is the data passed from UI till DB. What are the stages through it goes. 5) What are the different types of DBs and why I used NoSQL over RDBMS ? 6) What is REST architecture. What other APIs are available and why I used RestAPI over SoapAPI or any other ? 7) How can we implement security layer in my project using REST architecture ?","tq2":"Coding: 1) Given n nos in an array find the Kth smallest no (can't use direct in-built functions) 2) What is a Binary Search Tree ? and how it is different from Binary tree 3) Construct a Binary Search Tree from scratch using a given integer array 4) Finding Kth Smallest element from the Binary Search Tree  Puzzle: 1) Represent days of month using two dices of 6 faces each. Any no from 0 to 9 can be written on each of the 12 faces (6 on 1 dice, 6 on other dice). Note: Only 1 no can be written on 1 face of the dice. I had to represent days from 1 to 31 using both dice. E.g. if day is 26, then on 1 dice: 2 and other dice: 6, this way I had to place 1 no on each of the 6 faces of both dice using the nos 0 to 9 such that using those 2 dice any no from 1 to 31 (days of month) can be represented. It is allowed to rotate the dice in any manner for showing up the number.","hq1":"1) What do you know about the Insurance sector ? 2) What work Policy Bazaar does ? 3) Are you comfortable to move outside your native place and stay there for work purpose and why ? 4) Tell me something about your family, how many members and what profession my parents are working in ?","mrq":"","logo":"https://etimg.etb2bimg.com/photo/92142828.cms"},{"name":"PWC India","tq1":"Explain the four basic concepts of OOPS, Reverse a string , Trees in DSA, Hashmapping in Dsa\nProject based techinacal questions\nWhat is cyber security?\nCore Java questions, What is OOPS, What are constructors in Java, Questions on basics if cloud, Resume based questions, Projects done, Positions of Leadership\nExpalin ARP spoofing,Dos,Ddos attacks.(Based on Project)\nIntroduce yourself\nGraphs\nWhat is ML and explain the algorithms used in your project.\nOOPS and cpp\nExplain about your project.\nWhat was your role in the project, and why did you opt for that particular role.\nExplain in brief about the concepts of OOPS and types of software engineering testing\n1. Tell me about your academic projects? 2. Enlighten me about your AI Domain project?. 3. Tell me about CIA Triad in 15 Words?\nHow fast is R-CNN algorithm when compared to others and why\n1-Explain your project ?2- working principal of ultrasonic sensor? 3-What is IOT?   4-what are the disadvantage of IOT and how we can overcome that ? 5-Where i streaming my data in tye project that i mention (hospital management system)? 6- real life example of IOT\n1) Explain Your any one best project mentioned in resume   2) My Project was based on Machine Learning ,So asked about various Machine Learning algorithm such as KNN,Kmean,regression forest   3)After that they gave me situation  based question like they told our we are developing similar app like google map what machine learning algorithm can we use in that so that people will buy our service instead of using free google map services\nBrief about your projects, few logic questions\nWhat is computer virus and its types?\nWhat are python libraries, what libraries have u used and where?, How data is accessed from an array?\nExplain your machine learning project\nFibonacci sequence in C++\nQuery for the second highest salary of an employee.\nA word \"prepare\" is given. Separate the letters which are repeating and give the logic behind it\nExplain OOPS using daily life examples\nOOPS concepts\nIntroduce yourself, Describe some of your projects, Describe some of the courses you studied as a part of B.Tech and how they were useful in your projects or everyday life.\nAbout Projects done\nIntroduce about yourself and explain any one of the project which you have mentioned in your Resume?\nExplain about yourself and your projects mentioned in resume\n1) Please introduce yourself 2) How would you differentiate between NumPy, Matplotlib and Pandas libraries? 3) Why would you use NumPy arrays as an alternative to Python List? 4) What is a Python dictionary? 5) Compare Python lists and tuples 6) Any questions for me?\nWhat is BI?, What is ddos attack and other questions based on project\nOOPS Concepts\nProjects asked in detail and research paper related questions all asked in very detail\nWhat is bit manipulation? What is static keyword in java ?\nBasic difference between java and python, OOPS concepts in java,  SQL joins etcc..","tq2":"Explain all the projects you have worked in, What is polymorphism, What is the time complexity of three basic sorting techniques\nResume, AWS, project based techinacal questions\n\n\n\nHow can you upload data collected from sensors to perform data analysis?\nPointers\nWhat is your understanding of 5G and explain it's core architecture.\nquestions related to resume\nDescribe OOPS concept.\n\nUniversity projects and their technicalities\n1. What are your familiar subjects? 2. What is the difference between Relational and Non- relational Databases?. Give examples.  3. Is MongoDB is Relational Database?\nYou can host a free site with github.io domain. HOw is it different from normal domains?\n\n1)Introduction about the hackathon mentioned in resume  2)Gave one puzzle question how can we make 120 using five 0 any mathematical operation is allowed 3)asked about the difficulties faced while working in hackathon project how did you overcome\n\nhow to detect fault in transmission line using scada system?\nExplain JAVA OOPs concepts and What are different frameworks of java used, explain them.\n\nA puzzle about water jars\nDifference between tuple and list in python.\nHow flexible are you when it comes to topics or subjects outside your majors.\nWhat is weight in a neural network?\nBasic electrical questions\n\nAbout general Resum based topics\n[After Explaining the Project] Why have you chosen this approach, other project related questions  and what is the model's efficiency ?\nExplain about yourself, what are errors and exceptions in Java, exception handling in Java, puzzle based question\n1) Please introduce yourself 2) Tell me about your project which you completed in your hackathon 3) Explain the code of your project after sharing your screen 4) Any questions for me?\nWhat is the time complexity of binary search tree?, Differnce between stack and queue. Real-life implementation of stack and queue? what are the different types of charts in PowerBi and its uses\nDifferent Software Engineering Models\nAbout process automation\nOops concepts, Different types of Website Attacks ? Difference between SQL injection and DDoS Attacks ? What is CDN in AWS Cloud ? Name few AWS services and explain them\nAbout some machine learning algorithms and buliding an ML model for visiting Tirumala by which we can say in which day we should travel to Tirumala to avoid more rush.","hq1":"What are your strengths, Open to relocate, Any previous internships\nWhat do you know about techinacal consulting?  Tell us something about PWC? Breif introduction\nA group discussion on social media\nWhy PwC, General HR questions\nWill you relocate?Are you comfortable working in other domains?Why join the company?\nWhat interests you about our organization\nTell me about yourself\nGive a brief introduction about yourself including 10th+12th board marks and your dreams and aspirations.\ninterests and availability for job\nWhat do you know about PWC and who all are competitors of PWC?\nWhat is the worst UI design you've ever encountered?\nBrief introduction, what makes you an ideal applicant for PwC\nCase Study(Suppose your director is giving insights to new project and you don't like his take on that, when you will confront him about this?  Explaining there is better alternative to choose)\nWhat do you think is the weakness of our company's model?\n1-introduce yourself 2-what are the challenging moment in your life and how we overcome that ? 3-why you want to join pwc ?\n1)class 10,12 school name and b.tech cgpa 2)your introduction that is not mentioned in resume 3)Talked a bit about company and its culture 4)Talked about relocation flexibility\nIntroduce yourself, why PWC\nWHY \"company name\"?\nWhy do you want to work at pwc?\nwhy migrate to the IT sector from a circuital branch?\nWould I be willing to relocate, Why did I choose pwc, what do I expect from the company?\nYour 10th, 12th marks, college CGPA and are you willing to relocate?\nAre you willing to relocate?\nTell me about yourself\nProject related questions, certifications\nWhy PWC India? How is PWC different from other competitors?, Difference between consulting and IT companies.\nGeneral details of candidate\nSelf Introduction, Location Preference , Marks/CGPA secured , Achievements\nIt was a GD ,explain about yourself and your projects in resume, are you ready for relocation\n1) Introduce yourself 2) Are you willing to relocate to any location? 3) Are you open to travel to any company location based on project requirements? 4) Do you have your academic score above 60% throughout? 5) Any questions for me?\nReallocation and why i wanted to join the company\nHow do you handle Conflict of Opinion in a Team Enviornment\nExtra curricular activities other than projects and about marks in 10th, 12th and undergraduate\nWhere do you see yourself 5 years from now ? What do you know about PwC ?\nAbout myself and projects that I have done in my 4 years of B.Tech and CGPA etcc..","mrq":"\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n","logo":"https://upload.wikimedia.org/wikipedia/commons/thumb/0/05/PricewaterhouseCoopers_Logo.svg/1200px-PricewaterhouseCoopers_Logo.svg.png"},{"name":"Qualcomm","tq1":"Implement Basic Logic Gates Using NAND and NOR and FSM, ENCODER, DECODER, FLIP FLOPS.\n• A few questions about my resume. • Draw transfer characteristics of inverter. • What is the threshold voltage of an inverter? • What is high and low Noise margin? What does it signify • Draw CMOS inverter and mark all 4 terminals. • Draw a physical diagram of an NMOS. • What happens if the body is not shorted to source? What might happen if it is connected to a higher voltage than source? • What are state machines? • Write the Verilog code for a mod-3 counter. • What are the common mistakes one can make while writing this Verilog code? • How would you make an AND gate with a 2x1 MUX? • How would you make an OR gate with an XOR gate?","tq2":"Micro controllers, construct 4x1 mux using 2x1 and write verilog code.\n• Asked a few general personal questions about me and resume. • A logical aptitude based question – If you have 2 cubes with 6 surfaces each, how will you any day of a month from 01 to 31 using the 2 cubes by writing any single digit number on each side of both the cube? • Implement an OR gate using NAND gates. • Draw an OR gate using a 2x1 MUX. • What is the equation of an EXOR gate? • Draw a NAND gate using CMOS logic. • Explain how it functions. • What is setup time and hold time? • What are the different types of Finite state machines? What is the difference? • Draw the state diagram of a sequence detector to detect - 01*0010*1 - where 1* means that 1 can be repeated any number of times and similarly 0*. • Verbally explain how you would write a Verilog code for a finite state machine. • Discussions regarding job location.","hq1":"a man has two cubes on his desk. every day he arranges both cubes so that the front faces show the current day of the month. what numbers are on the faces of the cubes to allow this?\nNo HR Round","mrq":"\n","logo":"https://1000logos.net/wp-content/uploads/2020/08/Qualcomm-Logo.png"},{"name":"Sapiens Technologies","tq1":"OOPS, Java Basics, Multithreading, Difference between Java and C++\nRegarding projects ,oops,sql and dsa.\nJava conceptual questions - oops, multithreading, collection framework, exceptions, etc. Coding question - mainly the question were basic with more focus on all the different ways to solve the given question. DBMS and OS conceptual questions\nQuestions related to sql, questions on java like exception handling, coding question on removing the odd numbers from list\n1)Find the second largest unique element in a array. 2)How to check if the linked list is palindrome or not. OOPS questions\njava and oops concepts\n1. Detail discussion on Projects . 2. Implementation of OOPS Concepts like polymorphism , Inheritance etc . 3. Sql queries (2nd Highest Salary) 4. C++ concepts like pointers , memory allocation etc.\nSQL queries based on given tables\nGeneral concepts about class like types of constructor, how to implement them. Virtual destructor, polymorphism, how to detect cycle in linked list, sorting algorithms,puzzles.\nQ1. Introduce yourself? Q2. Question about my previous projects from resume? Q3. Since you knew about the interview 1 day before I am sure you were practising some java questions? what was the last java program you wrote, open ide and implement that? ( I said reverse a string ) Q4. More ways to implement the same. Q5. basic SQL database design. ( vehicle owner, one user-to-many cars) Q6. asking me how to make it many users-to-many cars?\n1)Explain your projects in your resume, 2) Explain the concepts of OOPS, 3) Write a JAVA code to reverse a string, 4) SQL queries\nSQL commands, DDL , DML commands, Joins, Given two tables and was asked the output of left join, Java oops definitions\nAsked about projects I have done. Basic oops concepts like abstraction, overriding, overloading. One Aptitude question. Coding question is based on overloading.They also covered some key concepts on sql. SQL coding question on joins.\nExplain all OOPS concepts by taking pen as an example, Difference between bus and star topology,  explain normalization, explanation about Projects, internships\n1.Started with my introduction    2.oops questions      3.Operating system basic question       4. Computer network basic question      5. Puzzle\nSQL Database Connection Syntax, Java Maximum Element in Array Program Approach\n1) Projects related Questions. 2) 4 Pillars of object oriented Programming. 3) Difference between abstraction and inheritance. 4) what is polymorphism and different types of polymorphism. 5) Build a program in notepad to implement a linked list amd write the function to add and delete a node in the linked-List. 6) Given a target sum, print the pair of indexes of the array whose value is equal to the given sum. Return (-1, -1) if does not exist. 7) Two sql query questions. 8) Few questions related to java and oops.\nInterviewer, had given some of that code in oops in that he told to identify the parent class and also the child class, how the process will work here and also the how the characteristics will inherit and what features they will have?\n1. find longest palindrome substring in the given string. 2. How can you remove a loop from doubly linked list? 3. How can u remove a loop from circular linked list with duplicate elements, code it? Also covered basic concepts of os and dbms.  Puzzle: number 999 written with the help of matchsticks, you have to make the biggest possible number from it by removing any two matchsticks.\nLinked list palindrome","tq2":"Cloud Computing, Uses, How to host server, architecture\n4 coding questions 1 on arrays,1 on string and 2on on exceptions.\nIn-depth questions on Java, DBMS and operating systems. Detailed explanation. Differences and similarities. Some questions on blockchain tech (as I mentioned it in the 1st interview). Tricky puzzle question. Difficulty was medium.\nCoding question on pyramid pattern, sql questions, java questions related to inheritance, polymorphism, abstraction and encapsulation\n1)DBMS 2) Generate valid Paranthesis 3) Puzzle 4) About projects\nwrite a code to Find the frequencies of all duplicates elements in the array\n1. Puzzles . 2. Projects 3. SQL constraints . 4. Tower of hanoi program using recursion\nQuestions based on OOPS,strings,arrays\nResume specific questions, how to rotate a matrix by 90° without using extra space. DBMS basic questions, asked me to list down various algorithms I know, puzzle: you have two boxes containing 5 balls each they may be either black or red. You can draw out a ball from boxes but can't put them back. You have find minimum number of draws to tell how many red and black balls are there in each box.\nNA\n\nJava code for string reversal, printing number patterns, constructors, overloading and overriding, difference between an interpreter and compiler, Html background color question,\n\nwrite a query to display 2nd highest salary, html codes, dbms, PHP\n1. Introduction  2. Oops question and then asked me about technical interview-1  3. All Cs fundamental    4.Technomanagerial question just kike asking about that we are working on this technology are you intrested or have you ever had work on that technology\nJava OOPS Concepts with detailed examples, Questions on Projects\n\nWhat is method overloading and method overriding?\n1. Difference between friend function virtual function. 2. what do you understand by operator and function overloading, explain it with real world examples. 3. 2d array and linked list coding questions. Other oops concepts and some dsa questions were covered.   puzzle: A basket contains 5 apples. divide them among 5 kids so that each one has an apple and one apple stays in the basket.\nUnordered and ordered map","hq1":"Why do you want to work for us, what do you know about the company\nStrengths and weakness, what makes you different from others and few scenario based questions seemed like formality.\nResume related and basic HR questions\nQuestions on projects, previous internship experience\nAbout projects, achievements, hobbies, strengths and weakness\nintroduce yourself, go through your resume\n1. Comfortable with role , location . 2. What do you know about the company . 3. Question related to internship (what was your role, what project you worked on etc.)\nWhy do you want this particular role\nWhy do you want to join sapiens. Future goals and ambitions, are you comfortable with relocation etc\nQ1. Introduce yourself? ( He only wanted me to say my name and my native) Q2. Tell me more about your family What are your hobbies? Q3. Which Books have you read? ( Since I replied my hobbies are going to the gym, and reading books? ) Q4. Went deep into the books discussion by asking me which book have you read recently. Finally told me you are selected congratulations.\n1) General questions about Sapiens, 2) Vision and goal in your life, 3) Are you fine in relocation\nWhy are you the best fit, What would you choose if you have been offered from 2 companies, where do you see youself in 2030\ninterviewed about the company \"Sapiens\". Some questions on VIT and how I lead my life in vit. About my family.\nAbout sapiens\n1. Introduction    2. Asked me about how was my technical interview and given some situation to check how i react then he tell me ctc breakup and said me best of luck\nQuestions on Teamwork and Difficulties faced in Group Project\n1) How were the previous interviews. 2) Why yoh think sapiens is good for you. 3) Why you want to join sapiens. 4) what are your interests. 5) How you manage to solve critical problems. 6) Some counter questions related to my interests.\nTell me about yourself, family and company?\nI did not have any hr round\nExperience of technical and managerial interview","mrq":"\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n","logo":"https://pbs.twimg.com/profile_images/1536721921018044417/dDd_oJ_Z_400x400.jpg"},{"name":"Schlumberger","tq1":"All details about the internship I had done were asked. What I had done during my internship period and every minute information regarding the project I had worked on.","tq2":"","hq1":"NA","mrq":"","logo":"https://1000logos.net/wp-content/uploads/2020/09/Schlumberger-Logo.png"},{"name":"Siemens EDA","tq1":"Find square root of a number using binary search , Sort array of 0,1,2 in Linear time , Product of array except self , Level order traversal of Binary Tree\nBasic concepts of OOPS like polymorphism, inheritance etc. I was told to write a code to remove duplicates from an array.\n1) https://leetcode.com/problems/two-sum/  2)  https://www.geeksforgeeks.org/element-equal-to-the-sum-of-all-the-remaining-elements/","tq2":"Question on Dynamic Programming (Subset Sum), Reverse words in sentence , Questions on OOPS concepts (4 pillars with real life examples, Static and Inline functions , Copy constructor, pass by reference and pass by value) , Print Left View of Binary Tree , 2 Puzzles ( Cake cutting problem and Jar filling problem)\na 30 minutes long discussion on time complexities of different Dara Structures and what are the ways to improve their time complexities.\n1) Design a Linked List  2) Reverse the Linked List","hq1":"No HR round\nThere were no HR questions but a third technical interview where I was asked different oops concepts like class, object, virtual, copy constructors and was told to implement the same.\n1) Discussion on Projects  2)What is the difficult time you faced and how did you overcame it?","mrq":"\n\n","logo":"https://hetia.org/wp-content/uploads/2019/10/siemens-mentor-new-logo-1-1.jpg"},{"name":"Société Générale","tq1":"How do you access private data members outside the class?","tq2":"Display top view of Binary Tree.","hq1":"Family Background related","mrq":"","logo":"https://www.societegenerale.com/sites/default/files/societe-generale-logo.png"},{"name":"Societe Generale","tq1":"Self Introduction, Questions on Projects, Reverse pyramid coding question, Oops and basic java\nAsked me to share my screen and solve the given competitive programming problem\nWhat is the difference between left join, right join and cross join?\nwhat is polymorphism, abstraction?, write code for quicksort? explain projects and show code?\nRegarding Projects, Java, Sql queries, DBMS Concepts, linux\nSelf introduction, Projects , Oops(Mainly focused) , All sorting techniques , About the company , Coding , SQL and DBMS\ntwo coding question - 1) related to dp (frog jump) . 2) related to swapping of number and some question related to java basics\nIntroduction,Garbage Collection,Constructor types,Constructor Overloading,Can static method be overridden,Copy Constructor,Can we overload the main method,Heap Memory and Stack Memory,Shallow copy and Derp Copy,Oops,Normalization,String builder and String buffer,Acid properties along with real life examples and asked a reallife scenario and which command to be used,Tower of Hanoi\nCoding - Combination Sum , About the skills mentioned in resume, Questions about the skill that the student is interested in\nExplain and give examples for abstraction, encapsulation, polymorphism and inheritance in oops\nIntroduction, tell about projects, list, dictionary, doubly linked list, oops, DBMS, stack and queue.\nGiven an array of numbers. Find if there is a sub array of size 3 having consecutive numbers","tq2":"Oops coding questions, sum of two numbers using overloading and overriding, Garbage collections.\nACID Properties in DBMS\n\nwhat is the difference between java and python? difference between interpreter and compiler ? novalty in projects?\n\n\n\nIntroduction,Questions on Resume,About projects,Programming question,Displayed codes and asked the output,Cloud concepts as I have done the certifcation,SYnchronization methods,Management questions about team and leadership,Hobbies,General Knowledge questions\n\nExplain binary search tree. Given a list of numbers, construct a binary search tree\nPuzzles, projects, internship, managerial questions.\nResume Based Questions","hq1":"Introduction, Challenges faced in project, Strengths and weakness.\nSelf Introduction\nWhy this role suits you?\nexplain your projects ? tell us about your family ?, are you comfortable with relocation? are you okay with night shift ?\nWhy Societe Generale, about my tech stack, flexible/not with night shifts and location\nSelf introduction, About projects, About the company, behavioral questions\nmy introduction and about my family background. why i want to join this Soc Gen. Am i willing to relocate or not.\nIntroduction,Strengths and weaknesses,Did you face any challenges and how did you overcome it,What is success,Why should we hire you,What if there's so much burden with work how will you handle it,Where do you see yourself in 5 years,Why this company,What do you expact from this company,\nInterests of the student, Questions regarding handling the pressure, What is job and what is success, How would you handle a team when your superior is on leave?\nGive a brief about yourself\nWhere you live, what parents do, flexible with timings and location.\nHobbies, Resume Based Questions, family background","mrq":"\n\n\n\n\n\n\n\n\n\n\n","logo":"https://www.societegenerale.com/sites/default/files/societe-generale-logo.png"},{"name":"TATA Digital","tq1":"Questions on projects I did. What are microservices?, What are the types of storage options in AWS S3? How will you let someone access a file on the AWS S3?\nDifference between LinkedList and queue\nWhat knowledge do you have about cloud computing?\nYou are in a dark room and can not see anything. There is one drawer with infinite socks of three colours i.e red, blue and green. You have to take sock from the drawer one by one. After how many times you will have a same coloured pair of sock for sure.\nTCS Digital :  Explain projects in resume ,Explain blockchain and why is it important? Explain anonymity features of blockchain in detail with it's advantages and disadvantages ,Explain all stages of NLP ,Explain KNN algorithm step by step, Explain few python libraries which you had used recently","tq2":"How can you protect a file so that it is available only for the intended receiver?\nQuick sort algorithm implementation\n1. Check whether a string is palindrome or not? 2. Discussion on Natural language Processing project\nThere are 2 rooms in one room there is fan and in other room there are three switches. You can not see the fan from the room having switches. You are required to find by which switch the fan is associated. How many minimum number of times you have to go to the other room for identifying the associated switch.\nBank of America: Explain your best worked project in resume. Differentiate between all types of keys used in database systems and why is primary key important? ,Write query to find employee with second highest salary ,ACID properties in DBMS ,What is caching in OS and why is it important? ,Explain optimal page replacement with proper example. What is proxy server? ,What is DNS and what is it's function? ,What is SDLC? Explain how will you design an investing app for investors and highlight the features of that app in development terminologies. What technologies will you use for frontend and backend development?","hq1":"What are the Three most important factors in an organization? What are Three positive and negative things about yourself?\nIf you are team lead and anyone in your team is not interested in doing that project how will you tackle the situation?\nIf you got a job offer from your dream company and Tata digital, which one will you select and why?\nWhat do you know about tata neu app and what technologies the other companies are using.\nTCS Digital : While doing job will you do higher studies if you have the chance?,  Bank of America: What are your weaknesses? ,Do you prefer work from home or offline work?","mrq":"\n\n\n\n","logo":"https://i0.wp.com/www.smartprix.com/bytes/wp-content/uploads/2022/12/Tata-Digital.jpg?fit=1525%2C849&ssl=1"},{"name":"Thorogood","tq1":"Prepare a case study on the given companies and details","tq2":"Group Discussion on the given situations presented in a document","hq1":"Tell me about the biggest obstacle faced by you in academics or projects","mrq":"","logo":"https://thorogoodusa.com/wp-content/uploads/Thorogood_logo_4c_rev-R-1500x865-a30dd9e1-b8cc-40fe-9001-85c85205f1b6-600x346.jpg"},{"name":"UBS","tq1":"Questions about projects, stacks, queues\nWhat is bubble sort and what is the time complexity?\nProjects, stacks, Java Collections\nExplain Merge Sort and Code it. Asked about post order traversal of a Binary Tree.\nWrite a code to find string2 in string1 and if it is found, return the index of the first character.","tq2":"\n1. What is polymorphism? 2. What is garbage collection?\nInheritance and Abstraction\nFor I/O Operations in Memory Management, which of the following Data Structure is better ? 1. Array 2. Linked List\nHow can you limit requests through API?","hq1":"Tell something about the company, Tell about yourself\n1. Introduce yourself 2 . Will you relocate?\nTell me about yourself, what were the problems you faced during the making of your project and how did you solve them\nPuzzle- Given 2 persons, one always speaks truth & another always Lies. Ask A Question to determine which person speaks truth.\nBrief introduction, projects, what are the difficulties faced and how did you overcome it","mrq":"\n\n\n\n","logo":"https://1000logos.net/wp-content/uploads/2021/05/UBS-logo.png"},{"name":"Vellore Institute of Technology","tq1":"Estimate how many orders swiggy get per week in banglore(guestimate problem)\nWhat is your favorite project and explain it.\nExplain how garbage collector works in java","tq2":"What is data Analytics, tools, data warehouse, data mining\nWhat is your role in your project ?\n2. Difference between thread and process, 3.what is collection framework in java, 4.can a java program be executed without main method","hq1":"Where do you want to see yourself in 5 years?\nAre you willing to re-locate ?\n1.tell me your family details 2. Do you have problem with relocation","mrq":"\n\n","logo":"https://upload.wikimedia.org/wikipedia/en/thumb/c/c5/Vellore_Institute_of_Technology_seal_2017.svg/1200px-Vellore_Institute_of_Technology_seal_2017.svg.png"},{"name":"Verizon","tq1":"Define threads, Implement the same using Java.\nIn PHP, what is method overloading and method overriding","tq2":"\nIn PHP; How to remove whitespace","hq1":"Explain any one of your projects & Certification in detial\nWhat are your greatest strengths","mrq":"\n","logo":"https://s3.amazonaws.com/cms.ipressroom.com/354/files/20222/60f592e4b3aed30fb2e8a8b4_1_Brand+Logos/1_Brand+Logos_e86a51d3-11b7-42e1-b2bd-cdad912e132d-prv.jpg"},{"name":"Visa","tq1":"Questions on oops concept, coding question implementing polymorphism, sql questions and questions related to project","tq2":"Questions on project, question based on sorting, asked how we can connect webdev with os and a puzzle","hq1":"Why you choose your current college, strength and weakness, tell me about yourself","mrq":"","logo":"https://usa.visa.com/dam/VCOM/regional/ve/romania/blogs/hero-image/visa-logo-800x450.jpg"},{"name":"Wells Fargo","tq1":"In depth Java and OS related questions. One medium level coding question. Basic questions on testing and few standard questions on various computer concepts","tq2":"","hq1":"Just basic HR questions about why did u choose this company, strengths, weaknesses, location and compensations related questions.","mrq":"","logo":"https://upload.wikimedia.org/wikipedia/commons/thumb/e/e2/Wells_Fargo_Logo_%282020%29.svg/1200px-Wells_Fargo_Logo_%282020%29.svg.png"},{"name":"Wolters Kluwer","tq1":"Types of services provided by cloud\nQuestions related to project\nSql injection attack\nWork being done at internship, projects mentioned in cv\nQuestions from College projects, basic java and framework, explanation depth about the Java project structure.\nOS Concepts, Java, Python\nWhich tech stack are you good at?, Current technologies you are working on?, Preferred Language, Questions on Data Structure and Algorithm, Explain the projects you have mentioned in your resume in details, Asked questions related to my projects, Real life uses of DSA, Few questions based on Computer Network, Questions based on operating system, Data base management system and few sql queries, Explain in short that what you have studied(understood) in the subject Computer Network\nWhat is DevOps, its uses and scope, What is Cloud and different cloud services\nCode related to react and javascript and Question related to resume.\nAWS concepts: What is Region, What is the benefits of Cloud\nAWS Concepts, Tell me about yourself and location preferences.\nTell me about your project\nCode related to html css javascript and Question related to resume.\n1)Brief Introduction 2)Brief on academic projects 3)Roles that you have interested in\nWhat expertise have you worked upon in your previous job experiences","tq2":"What are activation functions in machine learning\n\nPenetration testing methdology\n\nFrameworks, spring boot, spring framework, core Java and reverse engineering\nSQL\n\nWhat is Normalization, What is DNS and Network Topologies\n\nQuestions from my projects\nQuestions from my project especially from Cloud.\nHow BI is important in IT industry\nSdlc process and explanation on the project\n1)Brief description of projects that we have done during academics 2)Any certifications?\nQuestions based on resume","hq1":"Certification I have\nPast experience,what do you know about the company\nTell me about yourself\nLong term goal, strong and weak areas\nPreferred location, weakness, strength and how to overcome the failure\nMy Projects\nTell me about yourself, About family, Preferred location, Why you think that you will be perfect fit for our company, Where you want to see yourself in next few years, What are the things you know about the company?, Do you have any questions?\nWhere do you see yourself in next 5 years\nQuestion related to yourself and which location will you prefer and will be comfortable working with.\n1) Tell me about yourself. 2) Questions from my projects.\nTell me about yourself, asked to explain about ongoing Internship's current role and location preferences.\nWhat problem you faced in project and how you solved them\nQuestion related to yourself and which location will you prefer and will be comfortable working with.\n1) Brief Introduction 2) Why do you want to join Wolters Kluwer? 3) Preferred location\nTell me about yourself and what milestone have you acheived in the past years which make you feel proud.","mrq":"\n\n\n\n\n\n\n\n\n\n\n\n\n\n","logo":"https://w1.pngwing.com/pngs/292/163/png-transparent-circle-design-wolters-kluwer-logo-kluwer-arbitration-green-text-line-area.png"},{"name":"Zee Entertainment Private Limited","tq1":"Difference between Information gathering,Penetration testing and Vulnerability Assesment and What is CIA?","tq2":"Basic linux commands like cat,grep..Etc and Project Discussion","hq1":"Why do you want to work with zee?","mrq":"","logo":"https://upload.wikimedia.org/wikipedia/commons/thumb/2/22/Zee_entertainment_enterprises_logo.svg/1200px-Zee_entertainment_enterprises_logo.svg.png"},{"name":"ZS Associates","tq1":"Many questions related to SQL Queries based on the situations given by Interviewer","tq2":"Theory questions on SQL Queries such as explain diff types of joins, explain in depth about various operations in SQL","hq1":"What was the one thing where you though and did something out of the box. What did you do when your team was in dire need of a leadership.","mrq":"","logo":"https://www.zs.com/content/dam/images/logos/ZS_Logo_RGB@4x.png"}]